{
  "intents": [
    {"tag": "greeting",
     "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day", "Hey", "Ekse", "Hi"],
     "responses": ["Hello Buddy", "Yebo yes, how can I help", "Eyyy watsupp", "Ekse Hoezit", "Hola", "Hey dude", "Heyoooo"]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Ok bye", "Bye Bye"],
     "responses": ["See you!", "Have a nice day", "Sure Bye", "Later dude", "Sayoonara", "Peace out", "Sure dude", "Ciao"]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You are welcome", "Sure dude"]
    },
    {"tag": "noanswer",
     "patterns": [],
     "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand", "I am still here dude"]
     },
     {"tag": "name",
      "patterns": ["What is your name", "Whats your name", "Tell me your name", "Who are you", "Ungubani", "Tell me about yourself", "You are"],
      "responses": ["I am GuwaTidbit", "My name is GuwaTidbit", "You can call me tidbit for short", "I am GuwaTidbit, my friends call me tidbit", "GuwaTidbit is my name"]
      },
      {"tag": "options",
       "patterns": ["What do you do", "How can you help", "What do you know", "What is your purpose", "How can you help"],
       "responses": ["I can tell you about IIT Guwahati", "I can give you interesting facts about IIT Guwahati"]
      },
     {"tag": "IIT_Guwahati_info",
      "patterns": ["IIT Guwahati", "What can you tell me about IITG", "IITG","IIT Guwahati" ,"Tell me about IITG", "What about IITG", "What do you know about IITG", "Tell me more about IITG", "What can you tell me about IIT Guwahati", "Tell me about IIT Guwahati", "What about IIT Guwahati", "What do you know about IIT Guwahati", "Tell me more about IIT Guwahati",
      "IIT Guwahati Facts", "IITG Facts", "Give me some facts about IITG", "Give me some facts about IIT Guwahati", "IITG Facts", "IITG interesting facts", "South Africa facts", "South Africa interesting facts", "Tell me something interesting"],
       "responses": [
        "IIT Guwahati was established in 1994 as the sixth member of the prestigious Indian Institutes of Technology (IITs) system.",
        "It is located on the northern banks of the Brahmaputra River, surrounded by picturesque landscapes.",
        "The institute's motto is 'सा विद्या या विमुक्तये' (Sa Vidya Ya Vimuktaye), which translates to 'Knowledge that Liberates.'",
        "IIT Guwahati's campus spans over 700 acres, blending modern infrastructure with natural beauty.",
        "The Brahmaputra Cracker and Polymer Limited (BCPL) has its headquarters at IIT Guwahati's campus.",
"The Institute has eleven academic departments offering a variety of undergraduate, postgraduate, and doctoral programs.",
"IIT Guwahati has been actively involved in cutting-edge research, particularly in fields like nanotechnology, biotechnology, and environmental studies.",
"The campus is home to numerous research centers, including the Center for Energy, the Center for Nanotechnology, and the Center for the Environment.",
"The annual cultural festival of IIT Guwahati is called 'Alcheringa,' attracting participants from across the country.",
"The technical festival, 'Techniche,' showcases innovations and advancements in technology through various competitions and events.",
"IIT Guwahati has been recognized for its efforts in environmental conservation and sustainable practices.",
"The campus has a biodiversity-rich area called 'Biosphere,' which houses a wide variety of flora and fauna.",
"The 'Brahmaputra Aamantran Abhiyan' aims to study and conserve the biodiversity of the Brahmaputra riverine ecosystem.",
"The 'Centre for Rural Technology' focuses on developing technologies for rural empowerment and sustainable development.",
"The 'Society for Industrial and Applied Mathematics' (SIAM) Student Chapter promotes interest in applied mathematics among students.",
"IIT Guwahati has collaborations with international universities and research institutions, fostering global academic exchange.",
"The 'Centre for Energy' at IIT Guwahati conducts research in areas like solar energy, biofuels, and energy-efficient technologies.",
"The 'Centre for Educational Technology' promotes technology-enabled education and learning methodologies.",
"The 'Gopinath Bordoloi Memorial Lecture' is an annual event that hosts distinguished personalities from various fields.",
"The 'North East Centre for Technology Application and Reach' (NECTAR) focuses on technology applications for the development of the northeastern region of India.",
"The 'Centre for Women's Studies' addresses gender-related issues through research and academic initiatives.",
"IIT Guwahati's 'Incubation Centre' supports entrepreneurial ventures by providing resources, mentorship, and infrastructure.",
"The campus is known for its unique architecture, integrating traditional Assamese designs with modern aesthetics.",
"IIT Guwahati has a vibrant student community, participating in various clubs and organizations catering to diverse interests.",
"The institute places emphasis on sports and fitness, with facilities for cricket, football, swimming, and indoor games.",
"IIT Guwahati's annual technical competition, 'Cognizance,' encourages students to engage in engineering challenges.",
"The 'Centre for Linguistic Science and Technology' explores linguistic diversity and technology applications in language studies.",
"The 'Central Instruments Facility' provides state-of-the-art instrumentation and analytical services for research purposes.",
"IIT Guwahati has been ranked among the top engineering institutions in India and globally.",
"The 'Centre for Sustainable Development' focuses on research and projects related to sustainable resource management.",
"The 'Ishan Vikas' program aims to inspire and educate school children from the northeastern states about science and technology.",
"IIT Guwahati's students often engage in social outreach programs to benefit nearby communities.",
"The institute offers interdisciplinary programs that encourage students to explore diverse fields of knowledge.",
"The 'Centre for Rural Management' works on research and projects related to rural development and livelihoods.",
"The 'Assam Gas Cracker Project' involves collaboration between IIT Guwahati and the gas cracker industry for research and innovation.",
"The 'Centre for Humanitarian Technology' applies technology for solving real-world humanitarian challenges.",
"IIT Guwahati's research in robotics and automation contributes to advancements in various industries.",
"The campus hosts lectures, seminars, and workshops by eminent scholars and experts from around the world.",
"The institute's 'Robotics Club' fosters interest in robotics and organizes competitions and workshops.",
"IIT Guwahati has a strong emphasis on student innovation and entrepreneurship.",
"The institute's library is well-equipped with a vast collection of books, journals, and digital resources.",
"The 'Centre for Environment' focuses on understanding and addressing environmental challenges.",
"IIT Guwahati's 'Bihu' celebrations showcase the rich cultural heritage of Assam through traditional performances.",
"The 'Assam Society' provides a platform for students from Assam to connect and promote their culture.",
"The 'Geotechnical Society' organizes events related to geotechnical engineering and soil mechanics.",
"IIT Guwahati's faculty members are involved in pioneering research across various disciplines.",
"The 'Eco Club' promotes awareness and action on environmental issues through various initiatives.",
"The 'Photography Club' encourages students to develop their photography skills and showcase their creativity.",
"The institute's medical facilities cater to the healthcare needs of students, faculty, and staff.",
"IIT Guwahati's alumni have made significant contributions to academia, industry, and entrepreneurship.",
"IIT Guwahati has been actively involved in promoting cultural exchange and understanding through international student exchange programs.",
"The 'Aeromodelling Club' encourages students to design and build aircraft models, fostering innovation in aviation.",
"The institute's 'Awaaz' club provides a platform for students to explore and showcase their vocal and musical talents.",
"IIT Guwahati's 'Mathematics and Physics Club' organizes events to stimulate interest in these foundational subjects.",
"The 'Fine Arts Club' promotes artistic expression and creativity among the student community.",
"The institute's 'Literary and Debating Club' hosts discussions, debates, and literary events to enhance communication skills.",
"IIT Guwahati's annual technical fest, 'Techniche,' attracts participants from various engineering colleges across the nation.",
"The 'Model United Nations Club' simulates UN proceedings, allowing students to engage in diplomacy and global affairs.",
"The 'Film and Photography Club' nurtures students' passion for filmmaking and photography through workshops and projects.",
"The institute's 'Quiz Club' conducts challenging quizzes that stimulate intellectual curiosity and general knowledge.",
"IIT Guwahati's 'Programming Club' hones students' coding skills through coding competitions and workshops.",
"The 'Electronics and Robotics Club' provides a platform for students to learn and experiment with electronics and robotics.",
"The 'Dance Club' promotes various dance forms, helping students develop their dancing abilities and stage performances.",
"The institute's 'TEDx' events bring together innovative ideas and speakers to inspire the audience.",
"IIT Guwahati's 'Science and Technology Council' coordinates academic and technical activities across the campus.",
"The 'Entrepreneurial Development Cell' nurtures the entrepreneurial spirit by organizing workshops, seminars, and mentoring sessions.",
"The 'Women's Cell' strives to create a safe and inclusive environment for women on campus.",
"The 'Adventure Club' organizes outdoor activities and adventure sports to encourage physical fitness and exploration.",
"IIT Guwahati's students often participate and excel in national and international competitions and hackathons.",
"The institute's 'Chemical Engineering Society' promotes academic and industrial knowledge sharing in chemical engineering.",
"The 'Mentorship Program' connects students with experienced professionals to provide guidance and career insights.",
"IIT Guwahati's 'National Service Scheme' (NSS) chapter engages students in social service and community development.",
"The 'Alumni Association' fosters a strong network among alumni, facilitating career growth and interaction.",
"The institute's 'Automobile Club' brings together students interested in automobiles and automotive technology.",
"IIT Guwahati's 'Biodiversity and Conservation Club' focuses on raising awareness about environmental preservation.",
"The 'Consulting Club' provides a platform for students interested in pursuing careers in consulting.",
"The 'Economics Club' hosts discussions and lectures on economic theories and current affairs.",
"IIT Guwahati has been recognized for its efforts in promoting sustainable transportation on campus.",
"The 'Music Club' offers opportunities for students to learn and perform various musical instruments and genres.",
"The 'Toastmasters Club' helps students develop public speaking, communication, and leadership skills.",
"IIT Guwahati's 'Chemistry Club' organizes events to explore the practical applications of chemistry in various fields.",
"The 'Fashion and Lifestyle Club' provides a platform for students interested in fashion, styling, and design.",
"The 'Sociology Club' encourages discussions and activities related to sociological concepts and societal issues.",
"IIT Guwahati's 'Deaf Association' works to create awareness about hearing-impaired individuals and their needs.",
"The 'Placement Cell' plays a crucial role in facilitating job placements and internships for students.",
"The institute's 'Design and Arts Club' fosters creativity and artistic expression through various mediums.",
"IIT Guwahati's 'Robot Soccer Team' participates in international competitions, showcasing advancements in robotics.",
"The 'Spicmacay' chapter at IIT Guwahati promotes Indian classical arts and culture among students.",
"The institute's 'Cycling Club' promotes cycling as an eco-friendly and healthy mode of transportation.",
"IIT Guwahati's 'Physics Club' organizes events to engage students in discussions about fundamental physics concepts.",
"The 'Spoken Word Poetry Club' provides a platform for students to share their poetic expressions and spoken word performances.",
"The institute's 'Food and Cooking Club' brings together students who share a passion for culinary arts.",
"IIT Guwahati's 'Mountaineering Club' encourages outdoor enthusiasts to explore the region's natural beauty.",
"The 'Hackathon Club' organizes coding hackathons, encouraging students to solve real-world problems through technology.",
"The institute's 'Toastmasters International' chapter helps students improve their communication and leadership skills.",
"IIT Guwahati's 'Literature Club' hosts literary discussions, book readings, and creative writing sessions.",
"The 'Sustainability Club' raises awareness about sustainable practices and environmental conservation.",
"The institute's 'Dramatics Club' provides a platform for students to explore acting, theater, and performing arts.",
"IIT Guwahati's 'Startup Incubation Center' supports student entrepreneurs in developing their innovative ideas.",
"The 'Social Entrepreneurship Cell' promotes projects and initiatives that address social issues and create positive impact.",
"IIT Guwahati's annual techno-cultural festival, 'Alcheringa,' showcases a vibrant fusion of art, music, and technology.",
"The institute's 'Drishti' club promotes visual arts, hosting workshops and exhibitions to nurture creativity.",
"IIT Guwahati's 'Brahmaputra Hostel' is the largest hostel complex in India, accommodating a significant portion of the student population.",
"The 'Tezpur University-IIT Guwahati Collaborative Program' offers unique interdisciplinary courses, enriching students' learning experience.",
"IIT Guwahati's 'E-Summit' serves as a platform for aspiring entrepreneurs to connect, learn, and pitch their ideas.",
"The 'Bamboo Pavilion' on campus is an architectural marvel, showcasing sustainable design principles using bamboo.",
"IIT Guwahati's 'Robocon' team excels in national robotics competitions, showcasing innovation and technical expertise.",
"The 'Aviation Club' fosters interest in aviation and aeronautics, offering insights into the world of flight.",
"IIT Guwahati's 'Adopt a Tree' initiative encourages students to care for and contribute to the campus ecosystem.",
"The 'Music Club' organizes 'Rongali Bihu' celebrations, embracing Assamese culture through traditional performances.",
"IIT Guwahati's 'Swachh Bharat Abhiyan' initiatives highlight the institute's commitment to cleanliness and hygiene.",
"The 'Astronomy Club' holds stargazing sessions, allowing students to explore the cosmos and celestial wonders.",
"IIT Guwahati's 'Wildlife Club' promotes awareness about local biodiversity and conservation efforts.",
"The 'Nalanda Reading Room' provides a serene space for students to immerse themselves in academic pursuits.",
"IIT Guwahati's 'Food Circle' serves as a hub for culinary exploration, featuring diverse cuisines from across India.",
"The 'Heritage Club' delves into Assam's rich history and traditions, fostering cultural appreciation.",
"IIT Guwahati's 'Green Technocrats' club encourages eco-friendly practices and sustainable innovations.",
"The 'Spoken Word Poetry Club' offers an expressive platform for students to share their poetic creations.",
"IIT Guwahati's 'EcoRun' event promotes fitness and environmental awareness through a nature-themed marathon.",
"The 'Cinephilia Club' screens movies from different genres, enhancing the cinematic experience for students.",
"IIT Guwahati's 'Robotics Lab' is equipped with advanced tools for research and development in robotics.",
"The 'Digital Media Society' fosters creativity through digital art, graphic design, and multimedia projects.",
"IIT Guwahati's 'Social Service Forum' engages students in various community service initiatives.",
"The 'Quiz Club' hosts intellectually stimulating quizzes, challenging students' knowledge and critical thinking.",
"IIT Guwahati's 'Drishya' club celebrates the art of photography, offering workshops and exhibitions.",
"The 'EcoFest' organized by the 'Ecological Club' raises awareness about ecological issues through creative mediums.",
"IIT Guwahati's 'Drama Club' showcases theatrical talent through engaging stage productions.",
"The 'Adventure Club' embarks on treks, hikes, and outdoor activities, fostering a spirit of exploration.",
"IIT Guwahati's 'Model Club' encourages students to build scale models of engineering projects and innovations.",
"The 'Technology Incubation Centre' supports startups with mentorship, resources, and infrastructure.",
"IIT Guwahati's 'Pixel' club explores digital art and animation, encouraging artistic expression through technology.",
"The 'Yoga Club' promotes holistic well-being, offering sessions to rejuvenate mind and body.",
"IIT Guwahati's 'Design Club' focuses on user-centered design and innovation across various disciplines.",
"The 'Entrepreneurship Cell' nurtures business acumen through workshops, speaker sessions, and competitions.",
"IIT Guwahati's 'Moot Court Society' hones students' legal knowledge and advocacy skills through mock trials.",
"The 'TEDxIITGuwahati' event brings inspiring speakers and thought-provoking ideas to the campus community.",
"IIT Guwahati's 'Food and Nutrition Club' promotes healthy eating habits and culinary skills.",
"The 'Literary Society' engages in literary discussions, writing workshops, and book reading sessions.",
"IIT Guwahati's 'Skill Development Program' offers courses to enhance practical skills beyond academics.",
"The 'Sanskriti Club' showcases cultural diversity through events, workshops, and performances.",
"IIT Guwahati's 'Swimming Pool' provides a refreshing spot for relaxation and fitness activities.",
"The 'Coding Warriors' club fosters coding skills through competitive programming challenges and events.",
"IIT Guwahati's 'Women in Science and Technology' initiative promotes gender diversity in STEM fields.",
"The 'Language Exchange Club' encourages language learning and cultural exchange among students.",
"IIT Guwahati's 'MindSpark' is an annual technical festival that features competitions, workshops, and lectures.",
"The 'Health and Fitness Club' organizes wellness activities and educates students about healthy lifestyles.",
"IIT Guwahati's 'Avant-Garde Club' explores modern art forms, encouraging creative experimentation.",
"The 'Nature Club' advocates for environmental awareness through workshops, seminars, and clean-up drives.",
"IIT Guwahati's 'Astronomy Observatory' provides students with telescopes for celestial observations.",
"The 'Film Society' screens a diverse range of films, fostering cinematic appreciation and discussions.",
"IIT Guwahati's 'Rural Development and Management Cell' works on projects that uplift rural communities.",
"The 'Agriculture and Gardening Club' promotes sustainable agricultural practices and maintains campus gardens.",
"IIT Guwahati's 'Hiking Club' organizes nature walks and hikes to explore the natural beauty of the region.",
"The 'Coding Competitions Society' hosts coding contests, enhancing students' problem-solving skills.",
"IIT Guwahati's 'Artificial Intelligence Club' explores AI technologies and their real-world applications.",
"The 'Geology Club' engages students in understanding the Earth's geological processes and history.",
"IIT Guwahati's 'EcoRun' event promotes fitness and environmental awareness through a nature-themed marathon.",
"The 'Sustainable Fashion Club' educates about ethical fashion choices and sustainable clothing practices.",
"IIT Guwahati's 'Nutrition Awareness Club' focuses on promoting healthy eating habits and nutritional awareness.",
"The 'Astronomy Club' hosts sky-watching sessions, introducing students to celestial wonders.",
"IIT Guwahati's 'Fine Arts Club' encourages creative expression through various art forms.",
"The 'Music Therapy Club' explores the healing power of music and its positive impact on well-being.",
"IIT Guwahati's 'Earth Sciences Club' delves into the study of geology, meteorology, and environmental science.",
"The 'Digital Marketing Club' provides insights into online marketing strategies and trends.",
"IIT Guwahati's 'Healthcare Awareness Club' promotes health awareness and conducts medical camps.",
"The 'Philosophy Club' engages students in thought-provoking discussions on philosophical topics.",
"IIT Guwahati's 'Renewable Energy Club' raises awareness about sustainable energy solutions.",
"The 'Artisans' Club' celebrates traditional craftsmanship and artistic heritage.",
"IIT Guwahati's 'Community Radio Station' broadcasts informative programs for the campus and local community.",
"The 'Entrepreneurial Conclave' brings together successful entrepreneurs to inspire and guide students.",
"IIT Guwahati's 'Mathematics Society' conducts math-based events to enhance problem-solving skills.",
"The 'Virtual Reality Club' explores the world of immersive technologies and simulations.",
"IIT Guwahati's 'Waste Management Club' promotes responsible waste disposal and recycling.",
"The 'Music Therapy Club' explores the healing power of music and its positive impact on well-being.",
"IIT Guwahati's 'Coding for a Cause' initiative develops software solutions for societal issues.",
"The 'Public Speaking Society' helps students improve their communication and presentation skills.",
"IIT Guwahati's 'Social Awareness Club' raises awareness about pressing societal issues.",
"The 'Future Innovators Club' encourages students to ideate and innovate for the future.",
"IIT Guwahati's 'Literary Circle' organizes literary events, debates, and writing workshops.",
"The 'Mindfulness and Meditation Club' promotes mental well-being through mindfulness practices.",
"IIT Guwahati's 'Environmental Law Society' focuses on legal aspects of environmental conservation.",
"The 'Global Awareness Club' explores international issues and cultural understanding.",
"IIT Guwahati's 'Design Thinking Club' encourages creative problem-solving and human-centered design.",
"The 'Green Energy Club' advocates for renewable energy adoption and sustainability.",
"IIT Guwahati's 'Film Appreciation Club' discusses and analyzes films from various genres.",
"The 'Makerspace' offers a creative hub for students to work on projects and prototypes.",
"IIT Guwahati's 'Ethical Hacking Club' promotes cybersecurity awareness and skills.",
"The 'Storytelling Society' nurtures the art of storytelling through performances and workshops.",
"IIT Guwahati's 'Language and Linguistics Club' explores diverse languages and linguistic phenomena.",
"The 'Business Analytics Club' delves into data-driven insights and analytical techniques.",
"IIT Guwahati's 'Literary and Cultural Fest' celebrates language, arts, and cultural diversity.",
"The 'App Development Club' teaches students to create mobile applications.",
"IIT Guwahati's 'Public Health Club' spreads awareness about health issues and preventive measures.",
"The 'Financial Literacy Club' educates students about personal finance and investment.",
"IIT Guwahati's 'Mindful Movement Club' combines physical fitness with mindfulness practices.",
"The 'Virtual Language Exchange' connects students to practice language skills with peers worldwide.",
"IIT Guwahati's 'Sustainable Agriculture Club' promotes eco-friendly farming practices.",
"The 'Innovation Symposium' gathers innovators and thinkers to discuss emerging trends.",
"IIT Guwahati's 'STEM Outreach Program' engages with local schools to inspire young minds.",
"The 'Home Gardening Initiative' encourages students to grow plants and herbs in their dorms."
       ]
      }
  ]
}
